# Задача 2. Расчет площади круга и длины его окружности
## Описание
Напишите программу для вычисления площади круга и длины произвольной окружности по заданному радиусу. Напомним, что площадь круга вычисляется по формуле: π x R² (константу π можно считать равной 3.14), а формула вычисления длины его окружности: 2 x π x R.

## Функционал программы
- Запросите пользователя ввести радиус окружности;
- Рассчитайте площадь круга, создав метод для её расчёта;
- Рассчитайте длину окружности, создав метод для её расчёта;
- Выведите на экран результат вычисления.
#
__Пример 1__
~~~
Введите радиус окружности в сантиметрах:
10 <enter>
Площадь круга: 314 см.кв.
Длина окружности: 62.8 см.
~~~
__Пример 2__
~~~
Введите радиус окружности в сантиметрах:
4 <enter>
Площадь круга: 50.24 см.кв.
Длина окружности: 25.12 см.
~~~
## Реализация

1. Я импортировал класс Scanner и создал объект типа Scanner.

~~~
import java.util.Scanner;

class Main {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
    }
}
~~~
2. Далле Я запрашивал число которое сохранил в переменной radius.
~~~
int radius = scanner.nextInt();
~~~
3. Я создал константу числа PI.
~~~
    public static final double PI = 3.14;
~~~   
4. Далее создал метод рaсчета площади круга.
~~~
   public static double calculateCircleArea(int radius) {
        return PI * radius * radius;
    }
~~~    
5. И метод расчета длинны окружности.
~~~
 public static double calculateCircleLength(int radius) {
        return 2 * PI * radius;
    }
~~~
6. Далее вызвал оба метода.
~~~
   double area = calculateCircleArea(radius);
   double length = calculateCircleLength(radius);
~~~
7. В результате программа завершилась с таким результатом.
~~~
  System.out.println("Площадь круга: " + area +  " см.кв.");
  System.out.println("Длина окружности: " + length +  " см.");
~~~
